---
layout: default
title: Anniversary
redirect_from:
- /anniversary/index.shtml
---

<A HREF="#fr">* LE FRAN&Ccedil;AIS SUIT *</A>

<P>******************************<BR>
It's time for a GOSLING party!<BR>
Venue: 4:30 pm, 30 May 2008, The Parliament Pub, Ottawa<BR>
http://www.parliamentpub.com<BR>
RSVP Requested at <A HREF="mailto:party08@goslingcommunity.org">party08ATgoslingcommunity.org</A> ( replacing AT with @ )<BR>
******************************

<P>Please share this open invitation with anyone you know who is
interested in &quot;Getting Open Source Logic INto Governments&quot;,
and who will be in Canada's National Capital region at the end of
May. Suggestions for the agenda can be sent to jpotvinATlinuxmail.org
and russellATflora.ca ( replacing AT with @ ).
<P><B>We ask you to RSVP via <A HREF="mailto:party08@goslingcommunity.org">party08ATgoslingcommunity.org</A> ( replacing AT with @ ) so the
Parliament Pub staff can plan the food.</B> Everyone would pay their own
drinks and particular food orders, but for general snacks we will ask
for a small contribution at the door (to be determined). Broader
community contributions towards the hosting of this open event will
reduce the cover charge. Potential contributors should directly
contact the Parliament Pub's owner, Stanley Lithwick:
parlpubATmagma.ca ( replace AT with @ ) / 613-563-0636. Companies,
organizations or individuals contributing before 26 May to the
general snacks fund will be recognized via a thank-you list at the
event. Any surplus funds will be donated to OGWiFi. <A HREF="http://ogwifi.ca">http://ogwifi.ca</A>

<P>We look forward to seeing you! <B>Please watch http://www.goslingcommunity.org/anniversary/ for any updates.</B>
<P>
</P>
<P>Joseph Potvin &amp; Russell McOrmond
</P>
<P>Co-coordiators
</P>
<HR>
<P>* SOME BACKGROUND *
</P>
<P>
</P>
<P>GOSLING started in May 2002 as a couple of informal Friday
get-togethers after work at the pub, to bounce around some ideas
ahead of the first free/libre/open source software event hosted by
the Government of Canada:
<A HREF="http://www.flora.ca/osss2002/eventssch-e.html">http://www.flora.ca/osss2002/eventssch-e.html</A>  The week-long event
was such a success that numerous participants wanted to talk further,
and then the gaggles never stopped. Indeed each week there's been so
much to talk about face-to-face that GOSLING hasn't missed a Friday
in six years! (Well, except that we don't meet in the last week of
December or first week of January.) Our first big splash was the
Ottawa Citizen's &quot;Tech Weekly&quot; cover story
<A HREF="http://www.flora.ca/citizen-20021010.phtml">http://www.flora.ca/citizen-20021010.phtml</A>  ... which to our
surprise, led to a congratulatory phonecall from a senior advisor in
the Privy Council Office.

<P>On Friday of 30 May 2008, we're organizing the biggest gaggle
ever. What's special about this 6th Anniversary in particular? Is it
because the six directions north, south, east, west, up and down are
symbolic of our collective efforts to ensure sincere software choice
in Canada? <A HREF="http://www.sincerechoice.org">http://www.sincerechoice.org</A>  That would be a good enough
reason. But really it's just because we've decided it's time to
celebrate evidence of Canadian Government Official Open Source
Engagement (Canada GOOSE). There was no announcement from Treasury
Board Secretariat (TBS) that you missed. No dramatic watershed moment
was needed. Instead, it has simply become evident that something
tangible has changed. It's as if you might notice some day this month
that the Canada Geese have arrived back to the shores of the Ottawa
River, not all at once, but in steadily increasing numbers.

<P>We recognize that free/libre/open solutions and suppliers still
face many barriers in Canadian Government operations. But the
official trajectory of the federal government's policy centre TBS now
unambiguously includes open source logic in its instructions and
recommendations to departments and agencies, and in its own
operations. Numerous teams thoughout the federal government who for a
long time have been acquiring and contributing software under
free/libre/open licenses, are finally feeling the broad
acknowledgement of their astuteness, after having been dismissed as
rogues for so long. So lets recognize progress with a party.

<P>Here are some other media mentions...
</P>
<UL>
<LI><A HREF="http://www.itbusiness.ca/it/client/en/home/News.asp?id=37389&amp;cid=3">http://www.itbusiness.ca/it/client/en/home/News.asp?id=37389&amp;cid=3</A>
<LI><A HREF="http://www.canada.com/ottawacitizen/news/sports/story.html?id=89151ee5-b410-4ee2-a5ec-3e117a6a8091">http://www.canada.com/ottawacitizen/news/sports/story.html?id=89151ee5-b410-4ee2-a5ec-3e117a6a8091</A>
<LI><A HREF="http://portland.indymedia.org/en/2004/05/288487.shtml">http://portland.indymedia.org/en/2004/05/288487.shtml</A>
<LI><A HREF="http://www.itbusiness.ca/it/client/en/Home/News.asp?id=4726">http://www.itbusiness.ca/it/client/en/Home/News.asp?id=4726</A>
<LI><A HREF="http://www.itbusiness.ca/it/client/en/home/news.asp?id=40487">http://www.itbusiness.ca/it/client/en/home/news.asp?id=40487</A>
</UL>
<P>
</P>
<A NAME="fr"></A><HR>

<P>******************************<BR>
Le temps est venu de f&ecirc;ter OISILLON (&laquo; GOSLING &raquo;
en anglais)!<BR>
Lieu: 16h30, le 30 mai 2008, au Parliament Pub, Ottawa<BR>
Rue Wellington, juste en face de la Tour de la Paix<BR>
http://www.parliamentpub.com<BR>
RSVP &agrave; <A HREF="mailto:party08@goslingcommunity.org">party08ATgoslingcommunity.org</A> (rempla&ccedil;ant AT par @)<BR>
******************************

<P>Veuillez transmettre cette invitation &agrave; toute personne qui
s'int&eacute;resse aux &laquo; Options innovatrices et synergiques
pour l'introduction du logiciel libre dans les organisations 
nationales &raquo; (OISILLON), et qui sera de passage dans la
r&eacute;gion de la capitale nationale du Canada &agrave; la fin de
mai.  On peut adresser des suggestions pour l'ordre du jour 
&agrave; jpotvinATlinuxmail.org et russellATflora.ca (rempla&ccedil;ant
AT par @).

<P><B>Nous vous invitons &agrave; confirmer votre pr&eacute;sence en
nous r&eacute;pondant &agrave;
<A HREF="mailto:party08@goslingcommunity.org">party08ATgoslingcommunity.org</A> (rempla&ccedil;ant AT par @) afin que
le personnel du Parliament Pub puisse pr&eacute;voir nos besoins en
nourriture.</B>  Chaque personne devra d&eacute;frayer les boissons et la
nourriture qu'elle consommera, mais nous vous demanderons une petite
contribution &agrave; la porte pour les amuse-gueules.  Toute
contribution de la communaut&eacute; aux frais de cette activit&eacute;
publique permettra de r&eacute;duire le tarif &agrave; la porte. Les
contributeurs &eacute;ventuels doivent contacter directement le
propri&eacute;taire du Parliament Pub, Stanley Lithwick:
parlpubATmagma.ca (remplacer AT par @) / 613-563-0636. Les
entreprises, organisations ou individus qui font une contribution
avant le 26 mai se verront salu&eacute;s lors de la rencontre. Tout
exc&eacute;dent de fonds sera vers&eacute; &agrave; OGWiFi.
<A HREF="http://ogwifi.ca">http://ogwifi.ca</A>


<P>Nous nous faisons une joie de vous retrouver!  <B>S&rsquo;il vous pla&icirc;t regarder http://www.goslingcommunity.org/anniversary/ pour les mises &agrave; jour.</B>
</P>
<P>
</P>
<P>Joseph Potvin et Russell McOrmond
</P>
<P>Les co-coordinateurs

<HR>
<P>* QUELQUES ANT&Eacute;C&Eacute;DENTS *
</P>
<P>
</P>
<P>OISILLON a commenc&eacute; en mai 2002 au gr&eacute; de rencontres
informelles dans un pub apr&egrave;s le travail les vendredi soirs
dans le but d'&eacute;changer des id&eacute;es en vue d'une semaine
d'activit&eacute;s sur les logiciels libres/ouverts qu'organiserait le gouvernement du Canada:
<A HREF="http://www.flora.ca/osss2002/eventssch-e.html">http://www.flora.ca/osss2002/eventssch-e.html</A>  La semaine d'activit&eacute;s
a &eacute;t&eacute; un tel succ&egrave;s que de nombreux participants
ont souhait&eacute; se retrouver de nouveau pour discuter, et depuis
les &quot;gaggles&quot; n'ont cess&eacute;.  En effet, &agrave;
chaque semaine, il y a tant &agrave; se raconter que OISILLON n'a pas
rat&eacute; un vendredi en six ans! (exception faite de la derni&egrave;re
semaine de d&eacute;cembre ou la premi&egrave;re semaine de janvier.)
Notre premi&egrave;re sortie publique a eu lieu dans la publication
&quot;Tech Weekly&quot; du Ottawa Citizen
<A HREF="http://www.flora.ca/citizen-20021010.phtml">http://www.flora.ca/citizen-20021010.phtml</A> ... et &agrave; notre grande
surprise nous avons re&ccedil;u un appel de f&eacute;licitations d'un
conseiller principal du Bureau du Conseil priv&eacute;.
</P>
<P>
</P>
<P>Le vendredi 30 mai 2008 sera notre plus grand &quot;gaggle&quot;.
Qu'est-ce que ce 6&egrave;me anniversaire a de particulier?  C'est
que les six directions nord, sud, est, &agrave; l'ouest, en haut et
en bas sont symboliques de nos efforts collectifs en vue de rendre
disponibles &quot;des choix v&eacute;ritables et sinc&egrave;res&quot;
de logiciels au Canada <A HREF="http://www.sincerechoice.org">http://www.sincerechoice.org</A>  Cela pourrait
suffire comme justification.  En r&eacute;alit&eacute;, nous avons
d&eacute;cid&eacute; qu'il est temps de c&eacute;l&eacute;brer la
pr&eacute;sence du &quot;logiciel ouvert dans les institutions
engag&eacute;es&quot; du gouvernement canadien (l'OIE du Canada).
Vous n'avez pas manqu&eacute; d'annonce du Secr&eacute;tariat du
Conseil du Tr&eacute;sor (SCT), et il n'y aura pas de lev&eacute;e du
rideau pour marquer l'occasion. Il est tout simplement devenu &eacute;vident
que quelque chose de tangible a chang&eacute;. C'est comme si
tout-&agrave;-coup vous remarquez que les bernaches du Canada sont de
retour sur les rives de la rivi&egrave;re des Outaouais, pas toutes &agrave;
la fois, mais en nombre croissant.
</P>
<P>
</P>
<P>Nous reconnaissons que les solutions libres et leurs fournisseurs
restent confront&eacute;s &agrave; de nombreux obstacles au sein du
gouvernement du Canada.  Toutefois l'organisme central des politiques
du gouvernement f&eacute;d&eacute;ral qu'est le Secr&eacute;tariat du
Conseil du Tr&eacute;sor reconnait d&eacute;sormais sans ambigu&iuml;t&eacute;
que les solutions libres sont des options valables pour les
minist&egrave;res et les organismes ainsi que dans ses propres
op&eacute;rations.  Les nombreuses &eacute;quipes du gouvernement
f&eacute;d&eacute;ral qui ont utilis&eacute; et contribu&eacute; au
d&eacute;veloppement de solutions libres se sentent enfin reconnues
pour leur contribution. Ainsi, nous tenons &agrave; marquer cette
&eacute;volution par une f&ecirc;te.
</P>
<P>
</P>
<P>Suivent quelques mentions dans les m&eacute;dias ...
</P>
<UL>
<LI><A HREF="http://www.itbusiness.ca/it/client/en/home/News.asp?id=37389&amp;cid=3">http://www.itbusiness.ca/it/client/en/home/News.asp?id=37389&amp;cid=3</A>
<LI><A HREF="http://www.canada.com/ottawacitizen/news/sports/story.html?id=89151ee5-b410-4ee2-a5ec-3e117a6a8091">http://www.canada.com/ottawacitizen/news/sports/story.html?id=89151ee5-b410-4ee2-a5ec-3e117a6a8091</A>
<LI><A HREF="http://portland.indymedia.org/en/2004/05/288487.shtml">http://portland.indymedia.org/en/2004/05/288487.shtml</A>
<LI><A HREF="http://www.itbusiness.ca/it/client/en/Home/News.asp?id=4726">http://www.itbusiness.ca/it/client/en/Home/News.asp?id=4726</A>
<LI><A HREF="http://www.itbusiness.ca/it/client/en/home/news.asp?id=40487">http://www.itbusiness.ca/it/client/en/home/news.asp?id=40487</A>
</UL>
